Edragon/WCH-CHV103/MounRiver_Update_V142/template/wizard/WCH/RISC-V/CH32V105/CH32V105xx.svd
        <resetValue>0x20</resetValue>
				<fields>
					<field>
						<name>RB_UIF_BUS_RST__RB_UIF_DETECT</name>
						<description>bus reset event interrupt flag for USB device mode, direct bit address clear or write 1 to clear;device detected event interrupt flag for USB host mode, direct bit address clear or write 1 to clear</description>
						<bitRange>[0:0]</bitRange>
            <access>read-write</access>
					</field>
					<field>
						<name>RB_UIF_TRANSFER</name>
						<description>USB transfer completion interrupt flag, direct bit address clear or write 1 to clear</description>
						<bitRange>[1:1]</bitRange>
            <access>read-write</access>
					</field>
					<field>
						<name>RB_UIF_SUSPEND</name>
						<description>USB suspend or resume event interrupt flag, direct bit address clear or write 1 to clear</description>
						<bitRange>[2:2]</bitRange>
            <access>read-write</access>
					</field>
					<field>
						<name>RB_UIF_HST_SOF</name>
						<description>host SOF timer interrupt flag for USB host, direct bit address clear or write 1 to clear</description>
						<bitRange>[3:3]</bitRange>
            <access>read-write</access>
					</field>
					<field>
						<name>RB_UIF_FIFO_OV</name>
						<description>FIFO overflow interrupt flag for USB, direct bit address clear or write 1 to clear</description>
						<bitRange>[4:4]</bitRange>
            <access>read-write</access>
					</field>
					<field>
						<name>RB_U_SIE_FREE</name>
						<description>RO, indicate USB SIE free status</description>
						<bitRange>[5:5]</bitRange>
						<access>read-only</access>
					</field>
					<field>
						<name>RB_U_TOG_OK</name>
						<description>RO, indicate current USB transfer toggle is OK</description>
						<bitRange>[6:6]</bitRange>
						<access>read-only</access>
					</field>
					<field>
						<name>RB_U_IS_NAK</name>
						<description>RO, indicate current USB transfer is NAK received</description>
						<bitRange>[7:7]</bitRange>
						<access>read-only</access>
					</field>
				</fields>
			</register>
			<register>
				<name>R8_USB_INT_ST</name>
				<description>USB interrupt status</description>
				<addressOffset>0x07</addressOffset>
				<size>8</size>
				<access>read-only</access>
				<fields>
					<field>
						<name>MASK_UIS_H_RES__MASK_UIS_ENDP</name>
						<description>RO, bit mask of current transfer handshake response for USB host mode: 0000=no response, time out from device, others=handshake response PID received;RO, bit mask of current transfer endpoint number for USB device mode</description>
						<bitRange>[3:0]</bitRange>
					</field>
					<field>
						<name>MASK_UIS_TOKEN</name>
						<description>RO, bit mask of current token PID code received for USB device mode</description>
						<bitRange>[5:4]</bitRange>
					</field>
					<field>
						<name>RB_UIS_TOG_OK</name>
						<description>RO, indicate current USB transfer toggle is OK</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>RB_UIS_IS_NAK</name>
						<description>RO, indicate current USB transfer is NAK received for USB device mode</description>
						<bitRange>[7:7]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>R8_USB_RX_LEN</name>
				<description>USB receiving length</description>
				<addressOffset>0x08</addressOffset>
				<size>16</size>
				<access>read-only</access>
        <fields>
          <field>
            <name>R16_USB_RX_LEN</name>
						<description>length of received bytes</description>
						<bitRange>[9:0]</bitRange>
          </field>
        </fields>
			</register>
			<register>
				<name>R8_UEP4_1_MOD</name>
				<description>endpoint 4/1 mode</description>
				<addressOffset>0x0C</addressOffset>
				<size>8</size>
				<access>read-write</access>
        <resetValue>0x00</resetValue>
				<fields>
          <field>
						<name>RB_UEP4_BUF_MOD</name>
						<description>buffer mode of USB endpoint 4</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>RB_UEP4_TX_EN</name>
						<description>enable USB endpoint 4 transmittal (IN)</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>RB_UEP4_RX_EN</name>
						<description>enable USB endpoint 4 receiving (OUT)</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>RB_UEP1_BUF_MOD</name>
						<description>buffer mode of USB endpoint 1</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>RB_UEP1_TX_EN</name>
						<description>enable USB endpoint 1 transmittal (IN)</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>RB_UEP1_RX_EN</name>
						<description>enable USB endpoint 1 receiving (OUT)</description>
						<bitRange>[7:7]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>R8_UEP2_3_MOD__R8_UH_EP_MOD</name>
				<description>endpoint 2/3 mode;host endpoint mode</description>
				<addressOffset>0x0D</addressOffset>
				<size>8</size>
				<access>read-write</access>
        <resetValue>0x00</resetValue>
				<fields>
					<field>
						<name>RB_UEP2_BUF_MOD__RB_UH_EP_RBUF_MOD</name>
						<description>buffer mode of USB endpoint 2;buffer mode of USB host IN endpoint</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>RB_UEP2_TX_EN</name>
						<description>enable USB endpoint 2 transmittal (IN)</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>RB_UEP2_RX_EN__RB_UH_EP_RX_EN</name>
						<description>enable USB endpoint 2 receiving (OUT);enable USB host IN endpoint receiving</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>RB_UEP3_BUF_MOD__RB_UH_EP_TBUF_MOD</name>
						<description>buffer mode of USB endpoint 3;buffer mode of USB host OUT endpoint</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>RB_UEP3_TX_EN__RB_UH_EP_TX_EN</name>
						<description>enable USB endpoint 3 transmittal (IN);enable USB host OUT endpoint transmittal</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>RB_UEP3_RX_EN</name>
						<description>enable USB endpoint 3 receiving (OUT)</description>
						<bitRange>[7:7]</bitRange>
					</field>
				</fields>
			</register>
      <register>        
				<name>R8_UEP5_6_MOD</name>
				<description>endpoint 5/6 mode</description>
				<addressOffset>0x0e</addressOffset>
				<size>8</size>
				<access>read-write</access>
        <resetValue>0x00</resetValue>
				<fields>
					<field>
						<name>RB_UEP5_BUF_MOD</name>
						<description>buffer mode of USB endpoint 5</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>RB_UEP5_TX_EN</name>
						<description>enable USB endpoint 5 transmittal (IN)</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>RB_UEP5_RX_EN</name>
						<description>enable USB endpoint 5 receiving (OUT)</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>RB_UEP6_BUF_MOD</name>
						<description>buffer mode of USB endpoint 6</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>RB_UEP6_TX_EN</name>
						<description>enable USB endpoint 6 transmittal (IN)</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>RB_UEP3_RX_EN</name>
						<description>enable USB endpoint 6 receiving (OUT)</description>
						<bitRange>[7:7]</bitRange>
					</field>
				</fields>
			</register>
      <register>        
				<name>R8_UEP7_MOD</name>
				<description>endpoint 7 mode</description>
				<addressOffset>0x0f</addressOffset>
				<size>8</size>
				<access>read-write</access>
        <resetValue>0x00</resetValue>
				<fields>
					<field>
						<name>RB_UEP7_BUF_MOD</name>
						<description>buffer mode of USB endpoint 7</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>RB_UEP7_TX_EN</name>
						<description>enable USB endpoint 7 transmittal (IN)</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>RB_UEP7_RX_EN</name>
						<description>enable USB endpoint 7 receiving (OUT)</description>
						<bitRange>[3:3]</bitRange>
					</field>
				</fields>
			</register>

			<register>
				<name>R16_UEP0_DMA</name>
				<description>endpoint 0 DMA buffer address</description>
				<addressOffset>0x10</addressOffset>
				<size>16</size>
				<access>read-write</access>
			</register>
			<register>
				<name>R16_UEP1_DMA</name>
				<description>endpoint 1 DMA buffer address</description>
				<addressOffset>0x14</addressOffset>
				<size>16</size>
				<access>read-write</access>
			</register>
			<register>
				<name>R16_UEP2_DMA__R16_UH_RX_DMA</name>
				<description>endpoint 2 DMA buffer address;host rx endpoint buffer high address</description>
				<addressOffset>0x18</addressOffset>
				<size>16</size>
				<access>read-write</access>
			</register>
			<register>
				<name>R16_UEP3_DMA__R16_UH_TX_DMA</name>
				<description>endpoint 3 DMA buffer address;host tx endpoint buffer high address</description>
				<addressOffset>0x1C</addressOffset>
				<size>16</size>
				<access>read-write</access>
			</register>
      <register>
				<name>R16_UEP4_DMA</name>
				<description>endpoint 4 DMA buffer address</description>
				<addressOffset>0x20</addressOffset>
				<size>16</size>
				<access>read-write</access>
			</register>
      <register>
				<name>R16_UEP5_DMA</name>
				<description>endpoint 5 DMA buffer address</description>
				<addressOffset>0x24</addressOffset>
				<size>16</size>
				<access>read-write</access>
			</register>   
      <register>
				<name>R16_UEP6_DMA</name>
				<description>endpoint 6 DMA buffer address</description>
				<addressOffset>0x28</addressOffset>
				<size>16</size>
				<access>read-write</access>
			</register>   
      <register>
				<name>R16_UEP7_DMA</name>
				<description>endpoint 7 DMA buffer address</description>
				<addressOffset>0x2c</addressOffset>
				<size>16</size>
				<access>read-write</access>
			</register>            
			<register>
				<name>R16_UEP0_T_LEN</name>
				<description>endpoint 0 transmittal length</description>
				<addressOffset>0x30</addressOffset>
				<size>16</size>
				<access>read-write</access>
			</register>
			<register>
				<name>R8_UEP0_CTRL</name>
				<description>endpoint 0 control</description>
				<addressOffset>0x32</addressOffset>
				<size>8</size>
				<access>read-write</access>
        <resetValue>0x00</resetValue>
				<fields>
					<field>
						<name>MASK_UEP_T_RES</name>
						<description>bit mask of handshake response type for USB endpoint X transmittal (IN)</description>
						<bitRange>[1:0]</bitRange>
					</field>
					<field>
						<name>MASK_UEP_R_RES</name>
						<description>bit mask of handshake response type for USB endpoint X receiving (OUT)</description>
						<bitRange>[3:2]</bitRange>
					</field>
					<field>
						<name>RB_UEP_AUTO_TOG</name>
						<description>enable automatic toggle after successful transfer completion on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>RB_UEP_T_TOG</name>
						<description>prepared data toggle flag of USB endpoint X transmittal (IN): 0=DATA0, 1=DATA1</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>RB_UEP_R_TOG</name>
						<description>expected data toggle flag of USB endpoint X receiving (OUT): 0=DATA0, 1=DATA1</description>
						<bitRange>[7:7]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>R16_UEP1_T_LEN</name>
				<description>endpoint 1 transmittal length</description>
				<addressOffset>0x34</addressOffset>
				<size>16</size>
				<access>read-write</access>
			</register>
			<register>
				<name>R8_UEP1_CTRL__R8_UH_SETUP</name>
				<description>endpoint 1 control;host aux setup</description>
				<addressOffset>0x36</addressOffset>
				<size>8</size>
				<access>read-write</access>
        <resetValue>0x00</resetValue>        
				<fields>
					<field>
						<name>MASK_UEP_T_RES</name>
						<description>bit mask of handshake response type for USB endpoint X transmittal (IN)</description>
						<bitRange>[1:0]</bitRange>
					</field>
					<field>
						<name>MASK_UEP_R_RES</name>
						<description>bit mask of handshake response type for USB endpoint X receiving (OUT)</description>
						<bitRange>[3:2]</bitRange>
					</field>
					<field>
						<name>RB_UEP_AUTO_TOG</name>
						<description>enable automatic toggle after successful transfer completion on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>RB_UEP_T_TOG__RB_UH_SOF_EN</name>
						<description>prepared data toggle flag of USB endpoint X transmittal (IN): 0=DATA0, 1=DATA1;USB host automatic SOF enable</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>RB_UEP_R_TOG__RB_UH_PRE_PID_EN</name>
						<description>expected data toggle flag of USB endpoint X receiving (OUT): 0=DATA0, 1=DATA1;RB_UH_PRE_PID_EN;USB host PRE PID enable for low speed device via hub</description>
						<bitRange>[7:7]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>R16_UEP2_T_LEN__R8_UH_EP_PID</name>
				<description>endpoint 2 transmittal length;host endpoint and PID</description>
				<addressOffset>0x38</addressOffset>
				<size>16</size>
				<access>read-write</access>
				<fields>
					<field>
						<name>MASK_UH_ENDP</name>
						<description>bit mask of endpoint number for USB host transfer</description>
						<bitRange>[3:0]</bitRange>
					</field>
					<field>
						<name>MASK_UH_TOKEN</name>
						<description>bit mask of token PID for USB host transfer</description>
						<bitRange>[7:4]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>R8_UEP2_CTRL__R8_UH_RX_CTRL</name>
				<description>endpoint 2 control;host receiver endpoint control</description>
				<addressOffset>0x3A</addressOffset>
				<size>8</size>
				<access>read-write</access>
        <resetValue>0x00</resetValue>        
				<fields>
					<field>
						<name>MASK_UEP_T_RES</name>
						<description>bit mask of handshake response type for USB endpoint X transmittal (IN)</description>
						<bitRange>[1:0]</bitRange>
					</field>
					<field>
						<name>MASK_UEP_R_RES</name>
						<description>bit mask of handshake response type for USB endpoint X receiving (OUT)</description>
						<bitRange>[3:2]</bitRange>
					</field>
					<field>
						<name>RB_UEP_AUTO_TOG__RB_UH_R_AUTO_TOG</name>
						<description>enable automatic toggle after successful transfer completion on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle;enable automatic toggle after successful transfer completion: 0=manual toggle, 1=automatic toggle</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>RB_UEP_T_TOG</name>
						<description>prepared data toggle flag of USB endpoint X transmittal (IN): 0=DATA0, 1=DATA1</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>RB_UEP_R_TOG__RB_UH_R_TOG</name>
						<description>expected data toggle flag of USB endpoint X receiving (OUT): 0=DATA0, 1=DATA1;expected data toggle flag of host receiving (IN): 0=DATA0, 1=DATA1</description>
						<bitRange>[7:7]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>R16_UEP3_T_LEN__R16_UH_TX_LEN</name>
				<description>endpoint 3 transmittal length;host transmittal endpoint transmittal length</description>
				<addressOffset>0x3C</addressOffset>
				<size>16</size>
				<access>read-write</access>
			</register>
			<register>
				<name>R8_UEP3_CTRL__R8_UH_TX_CTRL</name>
				<description>endpoint 3 control;host transmittal endpoint control</description>
				<addressOffset>0x3E</addressOffset>
				<size>8</size>
				<access>read-write</access>
        <resetValue>0x00</resetValue>        
				<fields>
					<field>
						<name>MASK_UEP_T_RES</name>
						<description>bit mask of handshake response type for USB endpoint X transmittal (IN)</description>
						<bitRange>[1:0]</bitRange>
					</field>
					<field>
						<name>MASK_UEP_R_RES</name>
						<description>bit mask of handshake response type for USB endpoint X receiving (OUT)</description>
						<bitRange>[3:2]</bitRange>
					</field>
					<field>
						<name>RB_UEP_AUTO_TOG__RB_UH_T_AUTO_TOG</name>
						<description>enable automatic toggle after successful transfer completion on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>RB_UEP_T_TOG__TB_UH_T_TOG</name>
						<description>prepared data toggle flag of USB endpoint X transmittal (IN): 0=DATA0, 1=DATA1</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>RB_UEP_R_TOG</name>
						<description>expected data toggle flag of USB endpoint X receiving (OUT): 0=DATA0, 1=DATA1</description>
						<bitRange>[7:7]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>R16_UEP4_T_LEN</name>
				<description>endpoint 4 transmittal length</description>
				<addressOffset>0x40</addressOffset>
				<size>16</size>
				<access>read-write</access>
			</register>
			<register>
				<name>R8_UEP4_CTRL</name>
				<description>endpoint 4 control</description>
				<addressOffset>0x42</addressOffset>
				<size>8</size>
				<access>read-write</access>
        <resetValue>0x00</resetValue>        
				<fields>
					<field>
						<name>MASK_UEP_T_RES</name>
						<description>bit mask of handshake response type for USB endpoint X transmittal (IN)</description>
						<bitRange>[1:0]</bitRange>
					</field>
					<field>
						<name>MASK_UEP_R_RES</name>
						<description>bit mask of handshake response type for USB endpoint X receiving (OUT)</description>
						<bitRange>[3:2]</bitRange>
					</field>
					<field>
						<name>RB_UEP_AUTO_TOG</name>
						<description>enable automatic toggle after successful transfer completion on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>RB_UEP_T_TOG</name>
						<description>prepared data toggle flag of USB endpoint X transmittal (IN): 0=DATA0, 1=DATA1</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>RB_UEP_R_TOG</name>
						<description>expected data toggle flag of USB endpoint X receiving (OUT): 0=DATA0, 1=DATA1</description>
						<bitRange>[7:7]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>R16_UEP5_T_LEN</name>
				<description>endpoint 5 transmittal length</description>
				<addressOffset>0x44</addressOffset>
				<size>16</size>
				<access>read-write</access>
			</register>   
			<register>
				<name>R8_UEP5_CTRL</name>
				<description>endpoint 5 control</description>
				<addressOffset>0x46</addressOffset>
				<size>8</size>
				<access>read-write</access>
        <resetValue>0x00</resetValue>        
				<fields>
					<field>
						<name>MASK_UEP_T_RES</name>
						<description>bit mask of handshake response type for USB endpoint X transmittal (IN)</description>
						<bitRange>[1:0]</bitRange>
					</field>
					<field>
						<name>MASK_UEP_R_RES</name>
						<description>bit mask of handshake response type for USB endpoint X receiving (OUT)</description>
						<bitRange>[3:2]</bitRange>
					</field>
					<field>
						<name>RB_UEP_AUTO_TOG</name>
						<description>enable automatic toggle after successful transfer completion on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>RB_UEP_T_TOG</name>
						<description>prepared data toggle flag of USB endpoint X transmittal (IN): 0=DATA0, 1=DATA1</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>RB_UEP_R_TOG</name>
						<description>expected data toggle flag of USB endpoint X receiving (OUT): 0=DATA0, 1=DATA1</description>
						<bitRange>[7:7]</bitRange>
					</field>
				</fields>
			</register>
      <register>
				<name>R16_UEP6_T_LEN</name>
				<description>endpoint 6 transmittal length</description>
				<addressOffset>0x48</addressOffset>
				<size>16</size>
				<access>read-write</access>
			</register>
			<register>
				<name>R8_UEP6_CTRL</name>
				<description>endpoint 6 control</description>
				<addressOffset>0x4a</addressOffset>
				<size>8</size>
				<access>read-write</access>
        <resetValue>0x00</resetValue>        
				<fields>
					<field>
						<name>MASK_UEP_T_RES</name>
						<description>bit mask of handshake response type for USB endpoint X transmittal (IN)</description>
						<bitRange>[1:0]</bitRange>
					</field>
					<field>
						<name>MASK_UEP_R_RES</name>
						<description>bit mask of handshake response type for USB endpoint X receiving (OUT)</description>
						<bitRange>[3:2]</bitRange>
					</field>
					<field>
						<name>RB_UEP_AUTO_TOG</name>
						<description>enable automatic toggle after successful transfer completion on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>RB_UEP_T_TOG</name>
						<description>prepared data toggle flag of USB endpoint X transmittal (IN): 0=DATA0, 1=DATA1</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>RB_UEP_R_TOG</name>
						<description>expected data toggle flag of USB endpoint X receiving (OUT): 0=DATA0, 1=DATA1</description>
						<bitRange>[7:7]</bitRange>
					</field>
				</fields>
			</register>
      <register>
				<name>R16_UEP7_T_LEN</name>
				<description>endpoint 7 transmittal length</description>
				<addressOffset>0x4c</addressOffset>
				<size>16</size>
				<access>read-write</access>
			</register>
			<register>
				<name>R8_UEP7_CTRL</name>
				<description>endpoint 7 control</description>
				<addressOffset>0x4e</addressOffset>
				<size>8</size>
				<access>read-write</access>
        <resetValue>0x00</resetValue>        
				<fields>
					<field>
						<name>MASK_UEP_T_RES</name>
						<description>bit mask of handshake response type for USB endpoint X transmittal (IN)</description>
						<bitRange>[1:0]</bitRange>
					</field>
					<field>
						<name>MASK_UEP_R_RES</name>
						<description>bit mask of handshake response type for USB endpoint X receiving (OUT)</description>
						<bitRange>[3:2]</bitRange>
					</field>
					<field>
						<name>RB_UEP_AUTO_TOG</name>
						<description>enable automatic toggle after successful transfer completion on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>RB_UEP_T_TOG</name>
						<description>prepared data toggle flag of USB endpoint X transmittal (IN): 0=DATA0, 1=DATA1</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>RB_UEP_R_TOG</name>
						<description>expected data toggle flag of USB endpoint X receiving (OUT): 0=DATA0, 1=DATA1</description>
						<bitRange>[7:7]</bitRange>
					</field>
				</fields>
			</register>
